public enum MaleNames {
    Абрам, Аваз, Аввакум, Август, Августин, Авдей, Авенир, Аверьян, Авксентий, Автандил, Агап,
    Агафон, Агей, Адам, Адильхан, Адис, Адольф, Адриан, Азад, Азамат, Азар, Азарий, Азиз, Акакий,
    Аким, Алан, Александр, Алексей, Али, Алим, Алискер, Алихан, Алоис, Алферий, Альберт, Альбин, Альфред,
    Алянур, Амадей, Амадеус, Амаяк, Амвросий, Анастас, Анатолий, Анвар, Ангел, Андоим, Андрей, Андрон,
    Андроп, Анжей, Аникита, Анисим, Антип, Антон, Ануфрий, Анфим, Аполлон, Арам, Ардалион, Арий, Аристарх,
    Аристон, Аркадий, Арно, Арнольд, Арон, Арсен, Арсений, Арслан, Артамон, Артем, Артемий, Артур, Артём, Арулан,
    Архип, Аршак, Аршиддин, Арье, Аскар, Аскольд, Атанас, Афанасий, Афиноген, Африкан, Ахмет, Ашот, Бадри,
    Базан, Байракдар, Бари, Барузда, Батыр, Бахрам, Бахыт, Бежен, Бек, Бенедикт, Берек, Бернар, Бертран, Богдан,
    Боголюб, Болеслав, Бонифаций, Боримир, Борис, Борислав, Боря, Боян, Брачислав, Бронислав, Бруно, Будимир, Булат,
    Вавила, Ваган, Вадим, Валентин, Валера, Валерий, Валерьян, Вали, Вальтер, Варлаам, Варсонофий, Варфоломей,
    Василий, Васим, Вася, Велизар, Велор, Виктор, Влад, Владимир, Владислав, Вячеслав, Георг, Георгий, Глеб, Гордей, Григорий,
    Давид, Даниил, Даниэль, Дементий, Демьян, Денис, Дмитрий, Добрыня, Евгений, Егор, Елисей, Женя, Захар,
    Иван, Игнат, Игорь, Ильдар, Илья, Кирилл, Коля, Константин, Костя, Лев, Леон, Леонид, Лука, Максим,
    Марат, Марк, Марсель, Матвей, Мирон, Мирослав, Михаил, Назар, Никита, Николай, Олег, Павел,
    Петр, Платон, Радик, Родион, Рома, Роман, Руслан, Савва, Савелий, Святослав, Семен, Семён, Сергей, Станислав,
    Стас, Степа, Степан, Тимофей, Тимур, Федор, Филя, Фёдор, Эдуард, Эрик, Юрий, Яков, Ян, Ярослав;
}
